[
    {
      "title": "Fake Posts",
      "items": [
        {
          "name": "FIT2004",
          "rating": 2.48,
          "rated_by": 208,
          "comments": [
            "I hate this unit with all my being. FIT1008 was so much easier; why did they make this one a living hell? I can’t even do the first assignment, how am I gonna pass the exam??",
            "The unit is doable, don’t stress. I did it in 2023 and got an 82%, just make sure you read the notes for each topic BEFORE the seminar",
            "I didn’t find it too bad, it was definitely stressful but the assignments are manageable if you understand the lectures, otherwise you’re cooked :)",
            "I’m going to drop out.",
            "Idk why other people don’t like this unit, I had so much fun. I got a 96% unit score when I did it, it was a little more challenging than the easy first year units but still easy. For context I work at Jane Street.",
            "NOT EVERYONE IS SMART ENOUGH TO WORK AT JANE STREET, YOU’VE GOTTA BE TOP 0.1% FOR THAT THE AVERAGE PERSON DOES NOT FIND FIT2004 EASY YOU ARE THE ANOMALY SMART PEOPLE PISS ME OFF",
            "If you can make sure you read the notes before the lectures, do the prep questions and actually attend the applieds, you’ll be fine. It was hard, but passing is possible if you just do what I said. The lecturers are nice, but you can probably skip them and watch them online, I personally found reading the notes and then watching the lectures for clarification the easiest way to go about it."
          ]
        },
        {
          "name": "GYG Monash",
          "rating": 3.8,
          "rated_by": 576,
          "comments": [
            "Look, I don’t know if the burritos are authentic, but they’ve saved me from starvation between back-to-back lectures more times than I can count. 5/5 for convenience, 3.5/5 for flavour.",
            "Every time I get GYG before a tute I immediately regret it. Not because it’s bad… but because I end up in a food coma and can’t focus 😭",
            "Is it just me or is the guac basically liquid? Still tastes good but feels like I’m eating an avocado smoothie.",
            "Can we talk about the price tho?? $14 for a burrito and it doesn’t even come with chips?? Bro I’m a student not a crypto investor.",
            "I know right? I honestly feel like the quality’s dropped a bit this semester. Burritos are getting smaller and stingier on the fillings. Inflation got them too huh.",
            "I had a moment of pure bliss eating a spicy chicken burrito bowl next to the LTB lawn. Felt like I ascended temporarily.",
            "It’s the only place on campus that makes me feel something. Mostly happiness. Sometimes regret. But always something.",
            "The staff are genuinely so nice, even when I roll up dead-eyed after a 9am lecture. Bless them.",
            "If you're not putting the chipotle mayo on everything, you’re doing GYG wrong.",
            "Why does the GYG line always look like half of Clayton campus decided to major in burritos??",
            "Got food poisoning once and now I flinch whenever I see yellow signage. My stomach remembers what my brain tries to forget.",
            "Best hangover cure on campus. Don’t ask how I know. Just trust.",
            "Nacho fries go so hard. I would sell my soul for unlimited sauce packets.",
            "Once saw a guy cry into his tacos during midsem week. Honestly? Relatable. GYG: food for the emotionally unwell.",
            "Got extra Guac for free <3"
          ]
        },
        {
          "name": "Woodside Toilets (2nd floor)",
          "rating": 4.8,
          "rated_by": 48,
          "comments": [
            "8/10. Surprisingly modern. Felt like I was peeing in the future — but a future where the paper towel dispenser is always empty.",
            "10/10 acoustics. I’ve never heard such crisp echoing of my deepest regrets while sitting on cold porcelain.",
            "Awful. Why can’t people aim? The bowl is RIGHT THERE.",
            "4/10. The lighting was so bright I could see my GPA reflected in the tiles. Would not recommend during exam week.",
            "9/10 experience until I walked in on someone having a full-on breakdown in the third stall. We made eye contact. We are now spiritually bonded.",
            "Been struggling with POO1045, but this has been a great place to study, helped me pass my midsem exam.",
            "2/10. Too quiet. Every sound I made echoed through eternity. Felt judged by the universe itself.",
            "Can confirm the Woodside Building toilets are the most emotionally supportive on campus. They hug you in silence while you doomscroll TikTok and cry softly.",
            "1/10 experience. Someone walked in on me while I was having a breakdown about failing 2 of my assignments and we made eye contact. I think I need to transfer unis.",
            "6/10. High design, low soul. It’s like a Black Mirror episode in toilet form. I miss the grungy personality of the older campus loos.",
            "I was once in there for so long, Spotify asked if I was still listening. That’s the kind of comfort I look for in a toilet.",
            "5/10. Decent facilities but zero ambience. Where are the pot plants? The scented candles? The motivational posters??",
            "Woodside toilets feel like the bathroom equivalent of a LinkedIn profile. Clean, professional, and slightly insufferable.",
            "3/10. Sat down, stared at the stall door, and had a full existential crisis. Ambiance was too strong. Needed a dimmer switch for my emotions."
          ]
        },
        {
          "name": "LTB study area Ground Floor",
          "rating": 3.96,
          "rated_by": 357,
          "comments": [
            "LTB has some of the best-designed study spaces on campus. Natural lighting, open layouts, and lots of seating options make it easy to focus — when it’s not packed, that is.",
            "The booth seating is genuinely great for group work, but you have to get in early or they’re gone. By 10am, the good spots are always full.",
            "Really appreciate the power outlets at almost every seat. It’s such a small thing, but it makes a big difference when you're on campus all day.",
            "Yeah but half of them don’t even work. If I hadn’t noticed sooner my laptop would’ve died right before one of my 10% weighted quizzes. Law Library is wayyy better.",
            "It’s one of the most aesthetically pleasing places to study on campus. The big windows and high ceilings make it feel more spacious and less claustrophobic than the library.",
            "Which LTB are you studying at? It has maybe 5 big windows on one side, the rest is just surrounded by tute rooms.",
            "True, I normally study by the entrance next to the lawn, I forgot the inside wasn’t as great",
            "Not the quietest environment, but great for light study or doing group assignments. I wouldn’t recommend it if you need complete silence to focus.",
            "Can get pretty chaotic around lunchtime, with a lot of noise from both students and foot traffic. Mornings and evenings are the best times to get actual work done.",
            "The variety of seating options is great — couches, booths, open desks. It’s one of the few places on campus that supports different study styles.",
            "The lack of quiet zones is a downside, especially during exam season. It’s more of a collaborative workspace than a solo study haven.",
            "Aircon can be a bit intense sometimes, but otherwise it’s a comfortable place to spend a few hours. Bring a hoodie just in case.",
            "I wish the uni would expand on this kind of design across other buildings. LTB feels like it was actually built with students in mind.",
            "It’s beautiful and modern, but not always practical. Sometimes you’re fighting more for a seat than actually studying.",
            "If you come at off-peak times, it’s near perfect. Quiet, well-lit, comfortable — everything you’d want in a study space."
          ]
        }
      ]
    }
  ]
  